Revit 2027 API
PhaseStatusPresentation Enumeration
 An enumerated type listing the options for element display in a phase filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PhaseStatusPresentation
Public Enumeration PhaseStatusPresentation
public enum class PhaseStatusPresentation
type PhaseStatusPresentation
Members
Member name | Value | Description
DontShow | 0 |  Don't show elements from the given phase status.
ShowByCategory | 1 |  Show elements from the given phase status by category.
ShowOverriden | 2 |  Show elements from the given phase status by graphics overrides.
See Also
Reference
Autodesk.Revit.DB Namespace